Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg41_cult/pic32cx_sg41_getting_started/firmware/src/packs/PIC32CX1025SG41128_DFP/component/sdhc.h
/* -------- SDHC_PCR : (SDHC Offset: 0x29) (R/W 8) Power Control -------- */
#define SDHC_PCR_RESETVALUE                   _UINT8_(0x0E)                                        /*  (SDHC_PCR) Power Control  Reset Value */

#define SDHC_PCR_SDBPWR_Pos                   _UINT8_(0)                                           /* (SDHC_PCR) SD Bus Power Position */
#define SDHC_PCR_SDBPWR_Msk                   (_UINT8_(0x1) << SDHC_PCR_SDBPWR_Pos)                /* (SDHC_PCR) SD Bus Power Mask */
#define SDHC_PCR_SDBPWR(value)                (SDHC_PCR_SDBPWR_Msk & (_UINT8_(value) << SDHC_PCR_SDBPWR_Pos)) /* Assigment of value for SDBPWR in the SDHC_PCR register */
#define   SDHC_PCR_SDBPWR_OFF_Val             _UINT8_(0x0)                                         /* (SDHC_PCR) Power off  */
#define   SDHC_PCR_SDBPWR_ON_Val              _UINT8_(0x1)                                         /* (SDHC_PCR) Power on  */
#define SDHC_PCR_SDBPWR_OFF                   (SDHC_PCR_SDBPWR_OFF_Val << SDHC_PCR_SDBPWR_Pos)     /* (SDHC_PCR) Power off Position  */
#define SDHC_PCR_SDBPWR_ON                    (SDHC_PCR_SDBPWR_ON_Val << SDHC_PCR_SDBPWR_Pos)      /* (SDHC_PCR) Power on Position  */
#define SDHC_PCR_SDBVSEL_Pos                  _UINT8_(1)                                           /* (SDHC_PCR) SD Bus Voltage Select Position */
#define SDHC_PCR_SDBVSEL_Msk                  (_UINT8_(0x7) << SDHC_PCR_SDBVSEL_Pos)               /* (SDHC_PCR) SD Bus Voltage Select Mask */
#define SDHC_PCR_SDBVSEL(value)               (SDHC_PCR_SDBVSEL_Msk & (_UINT8_(value) << SDHC_PCR_SDBVSEL_Pos)) /* Assigment of value for SDBVSEL in the SDHC_PCR register */
#define   SDHC_PCR_SDBVSEL_1V8_Val            _UINT8_(0x5)                                         /* (SDHC_PCR) 1.8V (Typ.)  */
#define   SDHC_PCR_SDBVSEL_3V0_Val            _UINT8_(0x6)                                         /* (SDHC_PCR) 3.0V (Typ.)  */
#define   SDHC_PCR_SDBVSEL_3V3_Val            _UINT8_(0x7)                                         /* (SDHC_PCR) 3.3V (Typ.)  */
#define SDHC_PCR_SDBVSEL_1V8                  (SDHC_PCR_SDBVSEL_1V8_Val << SDHC_PCR_SDBVSEL_Pos)   /* (SDHC_PCR) 1.8V (Typ.) Position  */
#define SDHC_PCR_SDBVSEL_3V0                  (SDHC_PCR_SDBVSEL_3V0_Val << SDHC_PCR_SDBVSEL_Pos)   /* (SDHC_PCR) 3.0V (Typ.) Position  */
#define SDHC_PCR_SDBVSEL_3V3                  (SDHC_PCR_SDBVSEL_3V3_Val << SDHC_PCR_SDBVSEL_Pos)   /* (SDHC_PCR) 3.3V (Typ.) Position  */
#define SDHC_PCR_Msk                          _UINT8_(0x0F)                                        /* (SDHC_PCR) Register Mask  */


/* -------- SDHC_BGCR : (SDHC Offset: 0x2A) (R/W 8) Block Gap Control -------- */
#define SDHC_BGCR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_BGCR) Block Gap Control  Reset Value */

#define SDHC_BGCR_STPBGR_Pos                  _UINT8_(0)                                           /* (SDHC_BGCR) Stop at Block Gap Request Position */
#define SDHC_BGCR_STPBGR_Msk                  (_UINT8_(0x1) << SDHC_BGCR_STPBGR_Pos)               /* (SDHC_BGCR) Stop at Block Gap Request Mask */
#define SDHC_BGCR_STPBGR(value)               (SDHC_BGCR_STPBGR_Msk & (_UINT8_(value) << SDHC_BGCR_STPBGR_Pos)) /* Assigment of value for STPBGR in the SDHC_BGCR register */
#define   SDHC_BGCR_STPBGR_TRANSFER_Val       _UINT8_(0x0)                                         /* (SDHC_BGCR) Transfer  */
#define   SDHC_BGCR_STPBGR_STOP_Val           _UINT8_(0x1)                                         /* (SDHC_BGCR) Stop  */
#define SDHC_BGCR_STPBGR_TRANSFER             (SDHC_BGCR_STPBGR_TRANSFER_Val << SDHC_BGCR_STPBGR_Pos) /* (SDHC_BGCR) Transfer Position  */
#define SDHC_BGCR_STPBGR_STOP                 (SDHC_BGCR_STPBGR_STOP_Val << SDHC_BGCR_STPBGR_Pos)  /* (SDHC_BGCR) Stop Position  */
#define SDHC_BGCR_CONTR_Pos                   _UINT8_(1)                                           /* (SDHC_BGCR) Continue Request Position */
#define SDHC_BGCR_CONTR_Msk                   (_UINT8_(0x1) << SDHC_BGCR_CONTR_Pos)                /* (SDHC_BGCR) Continue Request Mask */
#define SDHC_BGCR_CONTR(value)                (SDHC_BGCR_CONTR_Msk & (_UINT8_(value) << SDHC_BGCR_CONTR_Pos)) /* Assigment of value for CONTR in the SDHC_BGCR register */
#define   SDHC_BGCR_CONTR_GO_ON_Val           _UINT8_(0x0)                                         /* (SDHC_BGCR) Not affected  */
#define   SDHC_BGCR_CONTR_RESTART_Val         _UINT8_(0x1)                                         /* (SDHC_BGCR) Restart  */
#define SDHC_BGCR_CONTR_GO_ON                 (SDHC_BGCR_CONTR_GO_ON_Val << SDHC_BGCR_CONTR_Pos)   /* (SDHC_BGCR) Not affected Position  */
#define SDHC_BGCR_CONTR_RESTART               (SDHC_BGCR_CONTR_RESTART_Val << SDHC_BGCR_CONTR_Pos) /* (SDHC_BGCR) Restart Position  */
#define SDHC_BGCR_RWCTRL_Pos                  _UINT8_(2)                                           /* (SDHC_BGCR) Read Wait Control Position */
#define SDHC_BGCR_RWCTRL_Msk                  (_UINT8_(0x1) << SDHC_BGCR_RWCTRL_Pos)               /* (SDHC_BGCR) Read Wait Control Mask */
#define SDHC_BGCR_RWCTRL(value)               (SDHC_BGCR_RWCTRL_Msk & (_UINT8_(value) << SDHC_BGCR_RWCTRL_Pos)) /* Assigment of value for RWCTRL in the SDHC_BGCR register */
#define   SDHC_BGCR_RWCTRL_DISABLE_Val        _UINT8_(0x0)                                         /* (SDHC_BGCR) Disable Read Wait Control  */
#define   SDHC_BGCR_RWCTRL_ENABLE_Val         _UINT8_(0x1)                                         /* (SDHC_BGCR) Enable Read Wait Control  */
#define SDHC_BGCR_RWCTRL_DISABLE              (SDHC_BGCR_RWCTRL_DISABLE_Val << SDHC_BGCR_RWCTRL_Pos) /* (SDHC_BGCR) Disable Read Wait Control Position  */
#define SDHC_BGCR_RWCTRL_ENABLE               (SDHC_BGCR_RWCTRL_ENABLE_Val << SDHC_BGCR_RWCTRL_Pos) /* (SDHC_BGCR) Enable Read Wait Control Position  */
#define SDHC_BGCR_INTBG_Pos                   _UINT8_(3)                                           /* (SDHC_BGCR) Interrupt at Block Gap Position */
#define SDHC_BGCR_INTBG_Msk                   (_UINT8_(0x1) << SDHC_BGCR_INTBG_Pos)                /* (SDHC_BGCR) Interrupt at Block Gap Mask */
#define SDHC_BGCR_INTBG(value)                (SDHC_BGCR_INTBG_Msk & (_UINT8_(value) << SDHC_BGCR_INTBG_Pos)) /* Assigment of value for INTBG in the SDHC_BGCR register */
#define   SDHC_BGCR_INTBG_DISABLED_Val        _UINT8_(0x0)                                         /* (SDHC_BGCR) Disabled  */
#define   SDHC_BGCR_INTBG_ENABLED_Val         _UINT8_(0x1)                                         /* (SDHC_BGCR) Enabled  */
#define SDHC_BGCR_INTBG_DISABLED              (SDHC_BGCR_INTBG_DISABLED_Val << SDHC_BGCR_INTBG_Pos) /* (SDHC_BGCR) Disabled Position  */
#define SDHC_BGCR_INTBG_ENABLED               (SDHC_BGCR_INTBG_ENABLED_Val << SDHC_BGCR_INTBG_Pos) /* (SDHC_BGCR) Enabled Position  */
#define SDHC_BGCR_Msk                         _UINT8_(0x0F)                                        /* (SDHC_BGCR) Register Mask  */

/* EMMC mode */
#define SDHC_BGCR_EMMC_Msk                    _UINT8_(0x00)                                         /* (SDHC_BGCR_EMMC) Register Mask  */


/* -------- SDHC_WCR : (SDHC Offset: 0x2B) (R/W 8) Wakeup Control -------- */
#define SDHC_WCR_RESETVALUE                   _UINT8_(0x00)                                        /*  (SDHC_WCR) Wakeup Control  Reset Value */

#define SDHC_WCR_WKENCINT_Pos                 _UINT8_(0)                                           /* (SDHC_WCR) Wakeup Event Enable on Card Interrupt Position */
#define SDHC_WCR_WKENCINT_Msk                 (_UINT8_(0x1) << SDHC_WCR_WKENCINT_Pos)              /* (SDHC_WCR) Wakeup Event Enable on Card Interrupt Mask */
#define SDHC_WCR_WKENCINT(value)              (SDHC_WCR_WKENCINT_Msk & (_UINT8_(value) << SDHC_WCR_WKENCINT_Pos)) /* Assigment of value for WKENCINT in the SDHC_WCR register */
#define   SDHC_WCR_WKENCINT_DISABLE_Val       _UINT8_(0x0)                                         /* (SDHC_WCR) Disable  */
#define   SDHC_WCR_WKENCINT_ENABLE_Val        _UINT8_(0x1)                                         /* (SDHC_WCR) Enable  */
#define SDHC_WCR_WKENCINT_DISABLE             (SDHC_WCR_WKENCINT_DISABLE_Val << SDHC_WCR_WKENCINT_Pos) /* (SDHC_WCR) Disable Position  */
#define SDHC_WCR_WKENCINT_ENABLE              (SDHC_WCR_WKENCINT_ENABLE_Val << SDHC_WCR_WKENCINT_Pos) /* (SDHC_WCR) Enable Position  */
#define SDHC_WCR_WKENCINS_Pos                 _UINT8_(1)                                           /* (SDHC_WCR) Wakeup Event Enable on Card Insertion Position */
#define SDHC_WCR_WKENCINS_Msk                 (_UINT8_(0x1) << SDHC_WCR_WKENCINS_Pos)              /* (SDHC_WCR) Wakeup Event Enable on Card Insertion Mask */
#define SDHC_WCR_WKENCINS(value)              (SDHC_WCR_WKENCINS_Msk & (_UINT8_(value) << SDHC_WCR_WKENCINS_Pos)) /* Assigment of value for WKENCINS in the SDHC_WCR register */
#define   SDHC_WCR_WKENCINS_DISABLE_Val       _UINT8_(0x0)                                         /* (SDHC_WCR) Disable  */
#define   SDHC_WCR_WKENCINS_ENABLE_Val        _UINT8_(0x1)                                         /* (SDHC_WCR) Enable  */
#define SDHC_WCR_WKENCINS_DISABLE             (SDHC_WCR_WKENCINS_DISABLE_Val << SDHC_WCR_WKENCINS_Pos) /* (SDHC_WCR) Disable Position  */
#define SDHC_WCR_WKENCINS_ENABLE              (SDHC_WCR_WKENCINS_ENABLE_Val << SDHC_WCR_WKENCINS_Pos) /* (SDHC_WCR) Enable Position  */
#define SDHC_WCR_WKENCREM_Pos                 _UINT8_(2)                                           /* (SDHC_WCR) Wakeup Event Enable on Card Removal Position */
#define SDHC_WCR_WKENCREM_Msk                 (_UINT8_(0x1) << SDHC_WCR_WKENCREM_Pos)              /* (SDHC_WCR) Wakeup Event Enable on Card Removal Mask */
#define SDHC_WCR_WKENCREM(value)              (SDHC_WCR_WKENCREM_Msk & (_UINT8_(value) << SDHC_WCR_WKENCREM_Pos)) /* Assigment of value for WKENCREM in the SDHC_WCR register */
#define   SDHC_WCR_WKENCREM_DISABLE_Val       _UINT8_(0x0)                                         /* (SDHC_WCR) Disable  */
#define   SDHC_WCR_WKENCREM_ENABLE_Val        _UINT8_(0x1)                                         /* (SDHC_WCR) Enable  */
#define SDHC_WCR_WKENCREM_DISABLE             (SDHC_WCR_WKENCREM_DISABLE_Val << SDHC_WCR_WKENCREM_Pos) /* (SDHC_WCR) Disable Position  */
#define SDHC_WCR_WKENCREM_ENABLE              (SDHC_WCR_WKENCREM_ENABLE_Val << SDHC_WCR_WKENCREM_Pos) /* (SDHC_WCR) Enable Position  */
#define SDHC_WCR_Msk                          _UINT8_(0x07)                                        /* (SDHC_WCR) Register Mask  */


