Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg41_cult/pic32cx_sg41_getting_started/firmware/src/packs/PIC32CX1025SG41128_DFP/component/sdhc.h
/* -------- SDHC_EISIER : (SDHC Offset: 0x3A) (R/W 16) Error Interrupt Signal Enable -------- */
#define SDHC_EISIER_RESETVALUE                _UINT16_(0x00)                                       /*  (SDHC_EISIER) Error Interrupt Signal Enable  Reset Value */

#define SDHC_EISIER_CMDTEO_Pos                _UINT16_(0)                                          /* (SDHC_EISIER) Command Timeout Error Signal Enable Position */
#define SDHC_EISIER_CMDTEO_Msk                (_UINT16_(0x1) << SDHC_EISIER_CMDTEO_Pos)            /* (SDHC_EISIER) Command Timeout Error Signal Enable Mask */
#define SDHC_EISIER_CMDTEO(value)             (SDHC_EISIER_CMDTEO_Msk & (_UINT16_(value) << SDHC_EISIER_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDHC_EISIER register */
#define   SDHC_EISIER_CMDTEO_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDTEO_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDTEO_MASKED             (SDHC_EISIER_CMDTEO_MASKED_Val << SDHC_EISIER_CMDTEO_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDTEO_ENABLED            (SDHC_EISIER_CMDTEO_ENABLED_Val << SDHC_EISIER_CMDTEO_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CMDCRC_Pos                _UINT16_(1)                                          /* (SDHC_EISIER) Command CRC Error Signal Enable Position */
#define SDHC_EISIER_CMDCRC_Msk                (_UINT16_(0x1) << SDHC_EISIER_CMDCRC_Pos)            /* (SDHC_EISIER) Command CRC Error Signal Enable Mask */
#define SDHC_EISIER_CMDCRC(value)             (SDHC_EISIER_CMDCRC_Msk & (_UINT16_(value) << SDHC_EISIER_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDHC_EISIER register */
#define   SDHC_EISIER_CMDCRC_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDCRC_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDCRC_MASKED             (SDHC_EISIER_CMDCRC_MASKED_Val << SDHC_EISIER_CMDCRC_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDCRC_ENABLED            (SDHC_EISIER_CMDCRC_ENABLED_Val << SDHC_EISIER_CMDCRC_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CMDEND_Pos                _UINT16_(2)                                          /* (SDHC_EISIER) Command End Bit Error Signal Enable Position */
#define SDHC_EISIER_CMDEND_Msk                (_UINT16_(0x1) << SDHC_EISIER_CMDEND_Pos)            /* (SDHC_EISIER) Command End Bit Error Signal Enable Mask */
#define SDHC_EISIER_CMDEND(value)             (SDHC_EISIER_CMDEND_Msk & (_UINT16_(value) << SDHC_EISIER_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDHC_EISIER register */
#define   SDHC_EISIER_CMDEND_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDEND_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDEND_MASKED             (SDHC_EISIER_CMDEND_MASKED_Val << SDHC_EISIER_CMDEND_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDEND_ENABLED            (SDHC_EISIER_CMDEND_ENABLED_Val << SDHC_EISIER_CMDEND_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CMDIDX_Pos                _UINT16_(3)                                          /* (SDHC_EISIER) Command Index Error Signal Enable Position */
#define SDHC_EISIER_CMDIDX_Msk                (_UINT16_(0x1) << SDHC_EISIER_CMDIDX_Pos)            /* (SDHC_EISIER) Command Index Error Signal Enable Mask */
#define SDHC_EISIER_CMDIDX(value)             (SDHC_EISIER_CMDIDX_Msk & (_UINT16_(value) << SDHC_EISIER_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_EISIER register */
#define   SDHC_EISIER_CMDIDX_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CMDIDX_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CMDIDX_MASKED             (SDHC_EISIER_CMDIDX_MASKED_Val << SDHC_EISIER_CMDIDX_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CMDIDX_ENABLED            (SDHC_EISIER_CMDIDX_ENABLED_Val << SDHC_EISIER_CMDIDX_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_DATTEO_Pos                _UINT16_(4)                                          /* (SDHC_EISIER) Data Timeout Error Signal Enable Position */
#define SDHC_EISIER_DATTEO_Msk                (_UINT16_(0x1) << SDHC_EISIER_DATTEO_Pos)            /* (SDHC_EISIER) Data Timeout Error Signal Enable Mask */
#define SDHC_EISIER_DATTEO(value)             (SDHC_EISIER_DATTEO_Msk & (_UINT16_(value) << SDHC_EISIER_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDHC_EISIER register */
#define   SDHC_EISIER_DATTEO_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_DATTEO_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_DATTEO_MASKED             (SDHC_EISIER_DATTEO_MASKED_Val << SDHC_EISIER_DATTEO_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_DATTEO_ENABLED            (SDHC_EISIER_DATTEO_ENABLED_Val << SDHC_EISIER_DATTEO_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_DATCRC_Pos                _UINT16_(5)                                          /* (SDHC_EISIER) Data CRC Error Signal Enable Position */
#define SDHC_EISIER_DATCRC_Msk                (_UINT16_(0x1) << SDHC_EISIER_DATCRC_Pos)            /* (SDHC_EISIER) Data CRC Error Signal Enable Mask */
#define SDHC_EISIER_DATCRC(value)             (SDHC_EISIER_DATCRC_Msk & (_UINT16_(value) << SDHC_EISIER_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDHC_EISIER register */
#define   SDHC_EISIER_DATCRC_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_DATCRC_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_DATCRC_MASKED             (SDHC_EISIER_DATCRC_MASKED_Val << SDHC_EISIER_DATCRC_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_DATCRC_ENABLED            (SDHC_EISIER_DATCRC_ENABLED_Val << SDHC_EISIER_DATCRC_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_DATEND_Pos                _UINT16_(6)                                          /* (SDHC_EISIER) Data End Bit Error Signal Enable Position */
#define SDHC_EISIER_DATEND_Msk                (_UINT16_(0x1) << SDHC_EISIER_DATEND_Pos)            /* (SDHC_EISIER) Data End Bit Error Signal Enable Mask */
#define SDHC_EISIER_DATEND(value)             (SDHC_EISIER_DATEND_Msk & (_UINT16_(value) << SDHC_EISIER_DATEND_Pos)) /* Assigment of value for DATEND in the SDHC_EISIER register */
#define   SDHC_EISIER_DATEND_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_DATEND_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_DATEND_MASKED             (SDHC_EISIER_DATEND_MASKED_Val << SDHC_EISIER_DATEND_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_DATEND_ENABLED            (SDHC_EISIER_DATEND_ENABLED_Val << SDHC_EISIER_DATEND_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_CURLIM_Pos                _UINT16_(7)                                          /* (SDHC_EISIER) Current Limit Error Signal Enable Position */
#define SDHC_EISIER_CURLIM_Msk                (_UINT16_(0x1) << SDHC_EISIER_CURLIM_Pos)            /* (SDHC_EISIER) Current Limit Error Signal Enable Mask */
#define SDHC_EISIER_CURLIM(value)             (SDHC_EISIER_CURLIM_Msk & (_UINT16_(value) << SDHC_EISIER_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDHC_EISIER register */
#define   SDHC_EISIER_CURLIM_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_CURLIM_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_CURLIM_MASKED             (SDHC_EISIER_CURLIM_MASKED_Val << SDHC_EISIER_CURLIM_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_CURLIM_ENABLED            (SDHC_EISIER_CURLIM_ENABLED_Val << SDHC_EISIER_CURLIM_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_ACMD_Pos                  _UINT16_(8)                                          /* (SDHC_EISIER) Auto CMD Error Signal Enable Position */
#define SDHC_EISIER_ACMD_Msk                  (_UINT16_(0x1) << SDHC_EISIER_ACMD_Pos)              /* (SDHC_EISIER) Auto CMD Error Signal Enable Mask */
#define SDHC_EISIER_ACMD(value)               (SDHC_EISIER_ACMD_Msk & (_UINT16_(value) << SDHC_EISIER_ACMD_Pos)) /* Assigment of value for ACMD in the SDHC_EISIER register */
#define   SDHC_EISIER_ACMD_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_ACMD_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_ACMD_MASKED               (SDHC_EISIER_ACMD_MASKED_Val << SDHC_EISIER_ACMD_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_ACMD_ENABLED              (SDHC_EISIER_ACMD_ENABLED_Val << SDHC_EISIER_ACMD_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_ADMA_Pos                  _UINT16_(9)                                          /* (SDHC_EISIER) ADMA Error Signal Enable Position */
#define SDHC_EISIER_ADMA_Msk                  (_UINT16_(0x1) << SDHC_EISIER_ADMA_Pos)              /* (SDHC_EISIER) ADMA Error Signal Enable Mask */
#define SDHC_EISIER_ADMA(value)               (SDHC_EISIER_ADMA_Msk & (_UINT16_(value) << SDHC_EISIER_ADMA_Pos)) /* Assigment of value for ADMA in the SDHC_EISIER register */
#define   SDHC_EISIER_ADMA_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_EISIER) Masked  */
#define   SDHC_EISIER_ADMA_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_EISIER) Enabled  */
#define SDHC_EISIER_ADMA_MASKED               (SDHC_EISIER_ADMA_MASKED_Val << SDHC_EISIER_ADMA_Pos) /* (SDHC_EISIER) Masked Position  */
#define SDHC_EISIER_ADMA_ENABLED              (SDHC_EISIER_ADMA_ENABLED_Val << SDHC_EISIER_ADMA_Pos) /* (SDHC_EISIER) Enabled Position  */
#define SDHC_EISIER_Msk                       _UINT16_(0x03FF)                                     /* (SDHC_EISIER) Register Mask  */

/* EMMC mode */
#define SDHC_EISIER_EMMC_BOOTAE_Pos           _UINT16_(12)                                         /* (SDHC_EISIER) Boot Acknowledge Error Signal Enable Position */
#define SDHC_EISIER_EMMC_BOOTAE_Msk           (_UINT16_(0x1) << SDHC_EISIER_EMMC_BOOTAE_Pos)       /* (SDHC_EISIER) Boot Acknowledge Error Signal Enable Mask */
#define SDHC_EISIER_EMMC_BOOTAE(value)        (SDHC_EISIER_EMMC_BOOTAE_Msk & (_UINT16_(value) << SDHC_EISIER_EMMC_BOOTAE_Pos))
#define SDHC_EISIER_EMMC_Msk                  _UINT16_(0x1000)                                      /* (SDHC_EISIER_EMMC) Register Mask  */


/* -------- SDHC_ACESR : (SDHC Offset: 0x3C) ( R/ 16) Auto CMD Error Status -------- */
#define SDHC_ACESR_RESETVALUE                 _UINT16_(0x00)                                       /*  (SDHC_ACESR) Auto CMD Error Status  Reset Value */

#define SDHC_ACESR_ACMD12NE_Pos               _UINT16_(0)                                          /* (SDHC_ACESR) Auto CMD12 Not Executed Position */
#define SDHC_ACESR_ACMD12NE_Msk               (_UINT16_(0x1) << SDHC_ACESR_ACMD12NE_Pos)           /* (SDHC_ACESR) Auto CMD12 Not Executed Mask */
#define SDHC_ACESR_ACMD12NE(value)            (SDHC_ACESR_ACMD12NE_Msk & (_UINT16_(value) << SDHC_ACESR_ACMD12NE_Pos)) /* Assigment of value for ACMD12NE in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMD12NE_EXEC_Val        _UINT16_(0x0)                                        /* (SDHC_ACESR) Executed  */
#define   SDHC_ACESR_ACMD12NE_NOT_EXEC_Val    _UINT16_(0x1)                                        /* (SDHC_ACESR) Not executed  */
#define SDHC_ACESR_ACMD12NE_EXEC              (SDHC_ACESR_ACMD12NE_EXEC_Val << SDHC_ACESR_ACMD12NE_Pos) /* (SDHC_ACESR) Executed Position  */
#define SDHC_ACESR_ACMD12NE_NOT_EXEC          (SDHC_ACESR_ACMD12NE_NOT_EXEC_Val << SDHC_ACESR_ACMD12NE_Pos) /* (SDHC_ACESR) Not executed Position  */
#define SDHC_ACESR_ACMDTEO_Pos                _UINT16_(1)                                          /* (SDHC_ACESR) Auto CMD Timeout Error Position */
#define SDHC_ACESR_ACMDTEO_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDTEO_Pos)            /* (SDHC_ACESR) Auto CMD Timeout Error Mask */
#define SDHC_ACESR_ACMDTEO(value)             (SDHC_ACESR_ACMDTEO_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDTEO_Pos)) /* Assigment of value for ACMDTEO in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDTEO_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDTEO_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) Timeout  */
#define SDHC_ACESR_ACMDTEO_NO                 (SDHC_ACESR_ACMDTEO_NO_Val << SDHC_ACESR_ACMDTEO_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDTEO_YES                (SDHC_ACESR_ACMDTEO_YES_Val << SDHC_ACESR_ACMDTEO_Pos) /* (SDHC_ACESR) Timeout Position  */
#define SDHC_ACESR_ACMDCRC_Pos                _UINT16_(2)                                          /* (SDHC_ACESR) Auto CMD CRC Error Position */
#define SDHC_ACESR_ACMDCRC_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDCRC_Pos)            /* (SDHC_ACESR) Auto CMD CRC Error Mask */
#define SDHC_ACESR_ACMDCRC(value)             (SDHC_ACESR_ACMDCRC_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDCRC_Pos)) /* Assigment of value for ACMDCRC in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDCRC_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDCRC_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) CRC Error Generated  */
#define SDHC_ACESR_ACMDCRC_NO                 (SDHC_ACESR_ACMDCRC_NO_Val << SDHC_ACESR_ACMDCRC_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDCRC_YES                (SDHC_ACESR_ACMDCRC_YES_Val << SDHC_ACESR_ACMDCRC_Pos) /* (SDHC_ACESR) CRC Error Generated Position  */
#define SDHC_ACESR_ACMDEND_Pos                _UINT16_(3)                                          /* (SDHC_ACESR) Auto CMD End Bit Error Position */
#define SDHC_ACESR_ACMDEND_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDEND_Pos)            /* (SDHC_ACESR) Auto CMD End Bit Error Mask */
#define SDHC_ACESR_ACMDEND(value)             (SDHC_ACESR_ACMDEND_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDEND_Pos)) /* Assigment of value for ACMDEND in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDEND_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDEND_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) End Bit Error Generated  */
#define SDHC_ACESR_ACMDEND_NO                 (SDHC_ACESR_ACMDEND_NO_Val << SDHC_ACESR_ACMDEND_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDEND_YES                (SDHC_ACESR_ACMDEND_YES_Val << SDHC_ACESR_ACMDEND_Pos) /* (SDHC_ACESR) End Bit Error Generated Position  */
#define SDHC_ACESR_ACMDIDX_Pos                _UINT16_(4)                                          /* (SDHC_ACESR) Auto CMD Index Error Position */
#define SDHC_ACESR_ACMDIDX_Msk                (_UINT16_(0x1) << SDHC_ACESR_ACMDIDX_Pos)            /* (SDHC_ACESR) Auto CMD Index Error Mask */
#define SDHC_ACESR_ACMDIDX(value)             (SDHC_ACESR_ACMDIDX_Msk & (_UINT16_(value) << SDHC_ACESR_ACMDIDX_Pos)) /* Assigment of value for ACMDIDX in the SDHC_ACESR register */
#define   SDHC_ACESR_ACMDIDX_NO_Val           _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_ACMDIDX_YES_Val          _UINT16_(0x1)                                        /* (SDHC_ACESR) Error  */
#define SDHC_ACESR_ACMDIDX_NO                 (SDHC_ACESR_ACMDIDX_NO_Val << SDHC_ACESR_ACMDIDX_Pos) /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_ACMDIDX_YES                (SDHC_ACESR_ACMDIDX_YES_Val << SDHC_ACESR_ACMDIDX_Pos) /* (SDHC_ACESR) Error Position  */
#define SDHC_ACESR_CMDNI_Pos                  _UINT16_(7)                                          /* (SDHC_ACESR) Command not Issued By Auto CMD12 Error Position */
#define SDHC_ACESR_CMDNI_Msk                  (_UINT16_(0x1) << SDHC_ACESR_CMDNI_Pos)              /* (SDHC_ACESR) Command not Issued By Auto CMD12 Error Mask */
#define SDHC_ACESR_CMDNI(value)               (SDHC_ACESR_CMDNI_Msk & (_UINT16_(value) << SDHC_ACESR_CMDNI_Pos)) /* Assigment of value for CMDNI in the SDHC_ACESR register */
#define   SDHC_ACESR_CMDNI_OK_Val             _UINT16_(0x0)                                        /* (SDHC_ACESR) No error  */
#define   SDHC_ACESR_CMDNI_NOT_ISSUED_Val     _UINT16_(0x1)                                        /* (SDHC_ACESR) Not Issued  */
#define SDHC_ACESR_CMDNI_OK                   (SDHC_ACESR_CMDNI_OK_Val << SDHC_ACESR_CMDNI_Pos)    /* (SDHC_ACESR) No error Position  */
#define SDHC_ACESR_CMDNI_NOT_ISSUED           (SDHC_ACESR_CMDNI_NOT_ISSUED_Val << SDHC_ACESR_CMDNI_Pos) /* (SDHC_ACESR) Not Issued Position  */
#define SDHC_ACESR_Msk                        _UINT16_(0x009F)                                     /* (SDHC_ACESR) Register Mask  */


/* -------- SDHC_HC2R : (SDHC Offset: 0x3E) (R/W 16) Host Control 2 -------- */
#define SDHC_HC2R_RESETVALUE                  _UINT16_(0x00)                                       /*  (SDHC_HC2R) Host Control 2  Reset Value */

